In [1]:
import numpy as np

In [2]:
import pandas as pd

In [5]:
label = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [7]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data=my_data, index=label)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(my_data, label)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(arr, label)

a    10
b    20
c    30
dtype: int32

In [15]:
d

{'a': 10, 'b': 20, 'c': 30}

In [16]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(data=label)

0    a
1    b
2    c
dtype: object

In [19]:
pd.Series(data=[sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [20]:
ser1 = pd.Series([1,2,3,4],['India', 'Germany', 'USA', 'UK'])

In [21]:
ser1

India      1
Germany    2
USA        3
UK         4
dtype: int64

In [22]:
ser2 = pd.Series([1,2,5,4], ['USA', 'France', 'Austria', 'Hungry'])

In [23]:
ser2

USA        1
France     2
Austria    5
Hungry     4
dtype: int64

In [25]:
ser1['USA']

3

In [26]:
ser2['USA']

1

In [27]:
ser1 + ser2

Austria    NaN
France     NaN
Germany    NaN
Hungry     NaN
India      NaN
UK         NaN
USA        4.0
dtype: float64

# Data Frames

In [28]:
import numpy as np

In [30]:
import pandas as pd

In [31]:
from numpy.random import randn

In [32]:
np.random.seed(101)

In [34]:
df1 = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [35]:
df1

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [36]:
df1['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [40]:
type(df1['W'])

pandas.core.series.Series

In [43]:
df1['W']['A']

0.3026654485851825

In [44]:
df1.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [48]:
df1[['W', 'Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [50]:
df1['SumWX'] = df1['W'] + df1['X']

In [51]:
df1['SumWX']

A    1.996388
B    0.255687
C    0.880666
D   -1.251174
E    1.784981
Name: SumWX, dtype: float64

In [52]:
df1

          W         X         Y         Z     SumWX
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [54]:
df1.drop('SumWX', axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [55]:
df1

          W         X         Y         Z     SumWX
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [56]:
df1.drop('SumWX', axis=1, inplace=True)

In [57]:
df1

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [59]:
df1.shape

(5, 4)

In [61]:
df1.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [62]:
type(df1.loc['A'])

pandas.core.series.Series

In [64]:
df1.iloc[1]

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

In [66]:
df1.loc['B', 'Y']

0.16690463609281317

In [67]:
df1.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [69]:
booldf1 = df1 > 0

In [70]:
booldf1

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [71]:
df1[booldf1]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [72]:
df1[df1 > 0]  #conditional selection

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [75]:
df1['W'] > 0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [76]:
df1[df1['W'] > 0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [80]:
df1[df1['Z'] < 0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [79]:
df1

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [82]:
df1.loc['A'] > 0

W     True
X     True
Y    False
Z    False
Name: A, dtype: bool

In [90]:
df1[df1['W'] > 0][['X', 'Y']]

          X         Y
A  1.693723 -1.706086
C  0.072960  0.638787

In [96]:
boolser = df1['W'] > 0
result = df1[boolser]
mycols = ['X', 'Y']
result[mycols]

          X         Y
A  1.693723 -1.706086
C  0.072960  0.638787

In [101]:
df1[(df1['W'] > 0) & (df1['Y'] > 0)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [102]:
df1[(df1['W'] > 0) | (df1['Y'] > 0)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

In [104]:
df1.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [105]:
new_index =  'CA NY WY OR CO'.split()

In [107]:
new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [108]:
df1['States'] =  new_index

In [109]:
df1

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [113]:
df1.set_index('States')

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [121]:
#Index Levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [124]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [125]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [126]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [131]:
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [134]:
df.loc['G1'].loc[1]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [137]:
df.index.names

FrozenList([None, None])

In [138]:
df.index.names = ['Groups', 'Num']

In [139]:
df

                   A         B
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [142]:
df.loc['G2'].loc[2]['B']

-0.6102588558227414

In [143]:
df.xs('G1')

            A         B
Num
1   -0.993263  0.196800
2   -1.136645  0.000366
3    1.025984 -0.156598

In [144]:
df.xs(1, level = 'Num')

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826

In [148]:
d = {'A' : [1, 2, np.nan], 'B' : [5, np.nan, np.nan], 'C' : [1, 2, 3]}

In [149]:
df2 = pd.DataFrame(d)

In [150]:
df2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [152]:
df2.dropna()

     A    B  C
0  1.0  5.0  1

In [153]:
df2.dropna(axis=1)

   C
0  1
1  2
2  3

In [155]:
df2.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [156]:
df2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [157]:
df2.fillna(value = 'EMPTY VALUE')

             A            B  C
0            1            5  1
1            2  EMPTY VALUE  2
2  EMPTY VALUE  EMPTY VALUE  3

In [160]:
df2['A'].fillna(value = df2['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [161]:
data = {'Company' : ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person' : ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales' : [200, 120, 340, 124, 243, 350]}

In [162]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [163]:
df = pd.DataFrame(data)

In [164]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [166]:
byComp = df.groupby('Company')

In [167]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [168]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [169]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [172]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [178]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [179]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [180]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [182]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [183]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000